-- phpMyAdmin SQL Dump
-- version 5.0.2
-- https://www.phpmyadmin.net/
--
-- ホスト: 127.0.0.1
-- 生成日時: 2020-10-23 07:46:39
-- サーバのバージョン： 10.4.14-MariaDB
-- PHP のバージョン: 7.4.10

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- データベース: `clinic`
--

-- --------------------------------------------------------

--
-- テーブルの構造 `キャンセル情報`
--

CREATE TABLE `キャンセル情報` (
  `予約番号` int(10) UNSIGNED NOT NULL,
  `キャンセル日時` timestamp NOT NULL DEFAULT current_timestamp(),
  `キャンセル者` int(10) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_bin;

--
-- テーブルのデータのダンプ `キャンセル情報`
--

INSERT INTO `キャンセル情報` (`予約番号`, `キャンセル日時`, `キャンセル者`) VALUES
(1, '2020-10-22 05:58:56', 1),
(2, '2020-10-22 06:02:12', 1),
(3, '2020-10-22 06:11:50', 1),
(9, '2020-10-22 06:12:10', 1),
(8, '2020-10-22 06:12:43', 1),
(7, '2020-10-22 06:12:45', 1),
(12, '2020-10-22 23:42:41', 1),
(10, '2020-10-23 05:16:03', 1);

-- --------------------------------------------------------

--
-- テーブルの構造 `スタッフ`
--

CREATE TABLE `スタッフ` (
  `スタッフＩＤ` mediumint(5) UNSIGNED NOT NULL,
  `氏名` varchar(30) COLLATE utf8mb4_bin NOT NULL,
  `スタッフ種別` int(30) NOT NULL,
  `連絡先` varchar(30) COLLATE utf8mb4_bin NOT NULL,
  `登録日時` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp(),
  `更新日時` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_bin;

-- --------------------------------------------------------

--
-- テーブルの構造 `予約情報`
--

CREATE TABLE `予約情報` (
  `予約番号` int(10) UNSIGNED ZEROFILL NOT NULL,
  `利用者ID` int(10) NOT NULL,
  `診療種別` tinyint(4) NOT NULL,
  `予防接種番号` int(10) UNSIGNED NOT NULL,
  `予約日` date NOT NULL,
  `予約時間` varchar(6) COLLATE utf8mb4_bin NOT NULL,
  `登録日時` timestamp NOT NULL DEFAULT current_timestamp(),
  `備考` varchar(1000) COLLATE utf8mb4_bin NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_bin;

--
-- テーブルのデータのダンプ `予約情報`
--

INSERT INTO `予約情報` (`予約番号`, `利用者ID`, `診療種別`, `予防接種番号`, `予約日`, `予約時間`, `登録日時`, `備考`) VALUES
(0000000001, 1, 2, 0, '2020-10-21', '16:30', '2020-10-19 03:41:49', ''),
(0000000002, 1, 2, 0, '2020-10-22', '16:30', '2020-10-19 04:01:55', 'なし'),
(0000000003, 1, 2, 0, '2020-10-22', '16:30', '2020-10-19 04:17:30', 'なし'),
(0000000004, 2, 2, 0, '2020-10-22', '16:30', '2020-10-19 06:07:38', 'なし'),
(0000000005, 2, 2, 0, '2020-10-22', '16:30', '2020-10-19 06:09:30', 'なし'),
(0000000006, 2, 2, 0, '2020-10-22', '16:30', '2020-10-19 06:09:50', 'なし'),
(0000000007, 1, 2, 0, '2020-10-22', '16:30', '2020-10-19 06:10:11', 'なし'),
(0000000008, 1, 2, 0, '2020-10-24', '16:30', '2020-10-21 04:15:58', 'なし'),
(0000000009, 1, 2, 0, '2020-10-24', '16:30', '2020-10-21 04:16:07', 'なし'),
(0000000010, 1, 2, 0, '2020-10-24', '16:30', '2020-10-21 04:16:53', 'なし'),
(0000000011, 1, 2, 0, '2020-10-24', '16:30', '2020-10-21 04:22:51', 'なし'),
(0000000012, 1, 2, 0, '2020-10-24', '16:30', '2020-10-21 04:23:33', 'なし'),
(0000000013, 2, 2, 0, '2020-10-24', '16:30', '2020-10-21 04:26:11', 'なし'),
(0000000014, 2, 2, 0, '2020-10-25', '16:30', '2020-10-22 01:21:50', 'なし'),
(0000000015, 2, 2, 0, '2020-10-25', '12:30', '2020-10-22 01:24:47', 'なし'),
(0000000016, 1, 2, 0, '2020-10-25', '12:30', '2020-10-22 04:21:16', 'なし'),
(0000000017, 3, 2, 0, '2020-10-25', '12:30', '2020-10-22 04:23:20', 'なし'),
(0000000018, 3, 2, 0, '2020-10-25', '12:30', '2020-10-22 04:35:00', 'なし'),
(0000000019, 1, 2, 0, '2020-10-26', '12:30', '2020-10-23 05:32:22', 'なし');

-- --------------------------------------------------------

--
-- テーブルの構造 `予防接種`
--

CREATE TABLE `予防接種` (
  `予防接種番号` int(10) UNSIGNED NOT NULL,
  `名称` varchar(50) COLLATE utf8mb4_bin NOT NULL,
  `種類` varchar(30) COLLATE utf8mb4_bin NOT NULL,
  `規定回数` tinyint(3) UNSIGNED NOT NULL,
  `最小接種可能月数` smallint(5) UNSIGNED NOT NULL,
  `費用負担` varchar(10) COLLATE utf8mb4_bin NOT NULL,
  `受付可能` smallint(6) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_bin;

--
-- テーブルのデータのダンプ `予防接種`
--

INSERT INTO `予防接種` (`予防接種番号`, `名称`, `種類`, `規定回数`, `最小接種可能月数`, `費用負担`, `受付可能`) VALUES
(1, 'B型肝炎', '不活性化', 3, 2, '公費', 0),
(2, 'ロタウイルス', '生', 2, 2, '公費', 0),
(3, 'ヒブ', '生', 4, 2, '公費', 0),
(4, '小児用肺炎球菌', '不活性', 4, 2, '公費', 0),
(5, '四種混合', '不活性', 4, 3, '公費', 0),
(6, 'BCG', '生', 1, 5, '公費', 0),
(7, 'MR（麻しん風疹混合）', '生', 2, 12, '公費', 0),
(8, '水痘（みずぼうそう）', '生', 2, 12, '公費', 0),
(9, 'おたふくかぜ', '生', 2, 12, '任意', 0),
(10, '日本脳炎（早期：3歳未満）', '不活性', 4, 6, '公費', 0),
(11, 'インフルエンザ', '不活性', 1, 6, '任意', 0),
(12, '髄膜炎金', '不活性', 1, 24, '任意', 0);

-- --------------------------------------------------------

--
-- テーブルの構造 `利用者`
--

CREATE TABLE `利用者` (
  `利用者ID` int(10) UNSIGNED ZEROFILL NOT NULL,
  `氏名` varchar(30) COLLATE utf8_bin NOT NULL,
  `生年月日` date NOT NULL,
  `性別` tinyint(4) DEFAULT NULL,
  `郵便番号` varchar(8) COLLATE utf8_bin DEFAULT NULL,
  `住所` varchar(150) COLLATE utf8_bin NOT NULL,
  `電話番号` varchar(15) COLLATE utf8_bin NOT NULL,
  `メール` varchar(254) COLLATE utf8_bin DEFAULT NULL,
  `保護者氏名` varchar(30) COLLATE utf8_bin DEFAULT NULL,
  `緊急連絡先` varchar(15) COLLATE utf8_bin DEFAULT NULL,
  `パスワード` varchar(10) COLLATE utf8_bin NOT NULL DEFAULT '0000',
  `登録日` timestamp NOT NULL DEFAULT current_timestamp(),
  `更新日` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

--
-- テーブルのデータのダンプ `利用者`
--

INSERT INTO `利用者` (`利用者ID`, `氏名`, `生年月日`, `性別`, `郵便番号`, `住所`, `電話番号`, `メール`, `保護者氏名`, `緊急連絡先`, `パスワード`, `登録日`, `更新日`) VALUES
(0000000001, '会員001', '2020-10-01', 1, '', '京都府京都市中京区111111111111111111111', '1234568987', 'mail@masdf.com', 'テスト保護者', '99999999', '0000', '2020-10-10 09:14:18', '2020-10-13 05:03:16'),
(0000000002, '会員002', '2018-10-01', 2, '', '京都府京都市中京区111111111111111111111', '1234568987', 'mail@masdf.com', 'テスト保護者', '99999999', '0000', '2020-10-10 09:14:30', '2020-10-13 05:03:40'),
(0000000003, '会員003', '1979-06-05', 2, '640-0443', '和歌山県海南市下津野4-7-1', '073-909-3490', 'okuuy0605@plala.or.jp  ', NULL, NULL, '0000', '2020-10-10 09:49:02', '2020-10-13 04:14:00'),
(0000000004, '会員004', '1979-06-05', 2, '640-0443', '和歌山県海南市下津野4-7-1', '073-909-3490', 'okuuy0605@plala.or.jp  ', NULL, NULL, '0000', '2020-10-10 09:49:02', '2020-10-13 04:18:29'),
(0000000006, '会員006', '1986-07-11', 1, '635-0805', '奈良県北葛城郡広陵町萱野3-9-5-415号室', '0745-68-0292', 'kzm.ksmt@example.jp  ', NULL, NULL, '0000', '2020-10-10 09:50:02', '2020-10-13 04:18:29'),
(0000000007, '会員007', '1986-10-09', 1, '160-0017', '東京都新宿区左門町1-2-4 アーバンティ左門町 211', '03-3459-4036', 'nrhr160nrhr160@example.ac.jp  ', NULL, NULL, '0000', '2020-10-10 09:50:02', '2020-10-13 04:18:29'),
(0000000008, '会員008', '1993-07-03', 1, '174-0051', '東京都板橋区小豆沢3-2-2', '03-3845-1491', 'knhr0703@combzmail.jp  ', NULL, NULL, '0000', '2020-10-10 09:50:02', '2020-10-13 04:18:29'),
(0000000009, '会員009', '1986-07-25', 1, '105-0004', '東京都港区新橋8-5-1', '03-3941-2346', 'mutuo-tuda@odn.ne.jp  ', NULL, NULL, '0000', '2020-10-10 09:50:02', '2020-10-13 04:18:29'),
(0000000013, '会員013', '1975-02-15', 1, '959-1963', '新潟県阿賀野市南沖山3-2-7 レジデンス南沖山 13階', '0254-05-4995', 'ryuuzi.nisio@web.ad.jp  ', NULL, NULL, '0000', '2020-10-10 09:50:12', '2020-10-13 04:18:29'),
(0000000014, '会員014', '1975-12-17', 1, '492-8175', '愛知県稲沢市北市場南町6-1-9', '0587-62-9116', '', NULL, NULL, '0000', '2020-10-10 09:50:12', '2020-10-13 04:18:29'),
(0000000015, '会員015', '1989-02-07', 2, '602-8036', '京都府京都市上京区西山崎町3-8-9', '075-898-9102', 'rs389@coara.or.jp  ', NULL, NULL, '0000', '2020-10-10 09:50:12', '2020-10-13 04:18:29'),
(0000000016, '会員016', '1989-02-02', 1, '362-0001', '埼玉県上尾市上7749', '048-126-0655', 'isoyim89@sunfield.ne.jp  ', NULL, NULL, '0000', '2020-10-10 09:50:12', '2020-10-13 04:18:30'),
(0000000017, '会員017', '1972-11-25', 1, '120-0031', '東京都足立区千住大川町9-13-5', '03-3088-9210', '', NULL, NULL, '0000', '2020-10-10 09:50:12', '2020-10-13 04:18:30'),
(0000000018, '会員018', '1975-11-12', 1, '567-0046', '大阪府茨木市南春日丘3887', '072-453-5930', 'yosinorihosino@gmail.com  ', NULL, NULL, '0000', '2020-10-10 09:50:12', '2020-10-13 04:18:30'),
(0000000019, '会員019', '1987-04-28', 2, '197-0824', '東京都あきる野市切欠5-1-6', '042-953-9931', 'isahakat0428@example.co.jp  ', NULL, NULL, '0000', '2020-10-10 09:50:12', '2020-10-13 04:18:30'),
(0000000020, '会員020', '1976-01-01', 1, '610-0101', '京都府城陽市平川5-5-3', '0774-66-9395', 'haruo0101@tokyo24.com  ', NULL, NULL, '0000', '2020-10-10 09:50:12', '2020-10-13 04:18:30'),
(0000000028, '会員028', '1974-04-05', 2, '103-0005', '東京都中央区日本橋久松町5-10-9', '03-3088-0876', 'rk@tokyo24.com  ', NULL, NULL, '0000', '2020-10-10 09:50:17', '2020-10-13 04:18:31'),
(0000000029, '会員029', '1981-08-23', 1, '604-0976', '京都府京都市中京区桑原町7-11-5 ドミシール桑原町', '075-635-6773', 'noriyuki81@dti.ne.jp  ', NULL, NULL, '0000', '2020-10-10 09:50:17', '2020-10-13 04:18:31'),
(0000000030, '会員030', '1970-10-07', 1, '671-2131', '兵庫県姫路市夢前町戸倉9-2-1', '07933-2-9163', 'hrn_ktnb@eaccess.net  ', NULL, NULL, '0000', '2020-10-10 09:50:17', '2020-10-13 04:18:31'),
(0000000031, '会員031', '1994-09-06', 1, '262-0014', '千葉県千葉市花見川区さつきが丘3-10-3 エステートさつきが丘 11F', '043-083-8129', 'aynas2620014@mxi.asp.home.ne.jp  ', NULL, NULL, '0000', '2020-10-10 09:50:17', '2020-10-13 04:18:31'),
(0000000032, '会員032', '1973-09-27', 2, '258-0023', '神奈川県足柄上郡開成町宮台1-14-6', '0465-34-4584', 'muraimaki@dsn.ad.jp  ', NULL, NULL, '0000', '2020-10-10 09:50:17', '2020-10-13 04:18:31'),
(0000000033, '会員033', '1975-11-12', 1, '193-0843', '東京都八王子市廿里町4-4-9', '0426-08-0844', 'imuziok1112@example.org  ', NULL, NULL, '0000', '2020-10-10 09:50:17', '2020-10-13 04:18:30'),
(0000000034, '会員034', '1981-03-17', 1, '577-0062', '大阪府東大阪市森河内東4-11-2', '06-6022-4484', 'akiyama_souzaburou@livedoor.com  ', NULL, NULL, '0000', '2020-10-10 09:50:17', '2020-10-13 04:18:30'),
(0000000035, '会員035', '1982-10-12', 1, '496-8019', '愛知県愛西市西川端町5-15-2', '0567-75-6931', 'urahorih1982@example.net  ', NULL, NULL, '0000', '2020-10-10 09:50:17', '2020-10-13 04:18:30'),
(0000000036, '会員036', '1976-12-30', 2, '612-8324', '京都府京都市伏見区小豆屋町7-5-3', '075-284-7485', 'okumura76@infoseek.co.jp  ', NULL, NULL, '0000', '2020-10-10 09:50:17', '2020-10-13 04:18:30'),
(0000000037, '会員037', '0000-00-00', NULL, NULL, '', '', NULL, NULL, NULL, '0000', '2020-10-10 09:50:17', '2020-10-10 23:36:21'),
(0000000038, '会員038', '0000-00-00', NULL, NULL, '', '', NULL, NULL, NULL, '0000', '2020-10-10 09:50:17', '2020-10-10 23:36:21'),
(0000000039, '会員039', '0000-00-00', NULL, NULL, '', '', NULL, NULL, NULL, '0000', '2020-10-10 09:50:17', '2020-10-10 23:36:21'),
(0000000040, '会員040', '0000-00-00', NULL, NULL, '', '', NULL, NULL, NULL, '0000', '2020-10-10 09:50:17', '2020-10-10 23:36:21'),
(0000000041, '会員041', '0000-00-00', NULL, NULL, '', '', NULL, NULL, NULL, '0000', '2020-10-10 09:50:17', '2020-10-10 23:36:21'),
(0000000042, '会員042', '0000-00-00', NULL, NULL, '', '', NULL, NULL, NULL, '0000', '2020-10-10 09:50:17', '2020-10-10 23:36:21'),
(0000000043, '会員043', '0000-00-00', NULL, NULL, '', '', NULL, NULL, NULL, '0000', '2020-10-10 09:50:17', '2020-10-10 23:36:21'),
(0000000059, '会員059', '0000-00-00', NULL, NULL, '', '', NULL, NULL, NULL, '0000', '2020-10-10 09:50:24', '2020-10-10 23:36:21'),
(0000000060, '会員060', '0000-00-00', NULL, NULL, '', '', NULL, NULL, NULL, '0000', '2020-10-10 09:50:24', '2020-10-10 23:36:21'),
(0000000061, '会員061', '0000-00-00', NULL, NULL, '', '', NULL, NULL, NULL, '0000', '2020-10-10 09:50:24', '2020-10-10 23:36:21'),
(0000000062, '会員062', '0000-00-00', NULL, NULL, '', '', NULL, NULL, NULL, '0000', '2020-10-10 09:50:24', '2020-10-10 23:36:21'),
(0000000063, '会員063', '0000-00-00', NULL, NULL, '', '', NULL, NULL, NULL, '0000', '2020-10-10 09:50:24', '2020-10-10 23:36:21'),
(0000000064, '会員064', '0000-00-00', NULL, NULL, '', '', NULL, NULL, NULL, '0000', '2020-10-10 09:50:24', '2020-10-10 23:36:21'),
(0000000065, '会員065', '0000-00-00', NULL, NULL, '', '', NULL, NULL, NULL, '0000', '2020-10-10 09:50:24', '2020-10-10 23:36:21'),
(0000000066, '会員066', '0000-00-00', NULL, NULL, '', '', NULL, NULL, NULL, '0000', '2020-10-10 09:50:24', '2020-10-10 23:36:21'),
(0000000067, '会員067', '0000-00-00', NULL, NULL, '', '', NULL, NULL, NULL, '0000', '2020-10-10 09:50:24', '2020-10-10 23:36:21'),
(0000000068, '会員068', '0000-00-00', NULL, NULL, '', '', NULL, NULL, NULL, '0000', '2020-10-10 09:50:24', '2020-10-10 23:36:21'),
(0000000069, '会員069', '0000-00-00', NULL, NULL, '', '', NULL, NULL, NULL, '0000', '2020-10-10 09:50:24', '2020-10-10 23:36:21'),
(0000000070, '会員070', '0000-00-00', NULL, NULL, '', '', NULL, NULL, NULL, '0000', '2020-10-10 09:50:24', '2020-10-10 23:36:21'),
(0000000071, '会員071', '0000-00-00', NULL, NULL, '', '', NULL, NULL, NULL, '0000', '2020-10-10 09:50:24', '2020-10-10 23:36:21'),
(0000000072, '会員072', '0000-00-00', NULL, NULL, '', '', NULL, NULL, NULL, '0000', '2020-10-10 09:50:24', '2020-10-10 23:36:21'),
(0000000073, '会員073', '0000-00-00', NULL, NULL, '', '', NULL, NULL, NULL, '0000', '2020-10-10 09:50:24', '2020-10-10 23:36:21'),
(0000000074, '会員074', '0000-00-00', NULL, NULL, '', '', NULL, NULL, NULL, '0000', '2020-10-10 09:50:24', '2020-10-10 23:36:21'),
(0000000075, '会員075', '0000-00-00', NULL, NULL, '', '', NULL, NULL, NULL, '0000', '2020-10-10 09:50:24', '2020-10-10 23:36:21'),
(0000000076, '会員076', '0000-00-00', NULL, NULL, '', '', NULL, NULL, NULL, '0000', '2020-10-10 09:50:24', '2020-10-10 23:36:21'),
(0000000077, '会員077', '0000-00-00', NULL, NULL, '', '', NULL, NULL, NULL, '0000', '2020-10-10 09:50:24', '2020-10-10 23:36:21'),
(0000000078, '会員078', '0000-00-00', NULL, NULL, '', '', NULL, NULL, NULL, '0000', '2020-10-10 09:50:24', '2020-10-10 23:36:21'),
(0000000079, '会員079', '0000-00-00', NULL, NULL, '', '', NULL, NULL, NULL, '0000', '2020-10-10 09:50:24', '2020-10-10 23:36:21'),
(0000000080, '会員080', '0000-00-00', NULL, NULL, '', '', NULL, NULL, NULL, '0000', '2020-10-10 09:50:24', '2020-10-10 23:36:21'),
(0000000081, '会員081', '0000-00-00', NULL, NULL, '', '', NULL, NULL, NULL, '0000', '2020-10-10 09:50:24', '2020-10-10 23:36:21'),
(0000000082, '会員082', '0000-00-00', NULL, NULL, '', '', NULL, NULL, NULL, '0000', '2020-10-10 09:50:24', '2020-10-10 23:36:21'),
(0000000083, '会員083', '0000-00-00', NULL, NULL, '', '', NULL, NULL, NULL, '0000', '2020-10-10 09:50:24', '2020-10-10 23:36:21'),
(0000000084, '会員084', '0000-00-00', NULL, NULL, '', '', NULL, NULL, NULL, '0000', '2020-10-10 09:50:24', '2020-10-10 23:36:21'),
(0000000085, '会員085', '0000-00-00', NULL, NULL, '', '', NULL, NULL, NULL, '0000', '2020-10-10 09:50:24', '2020-10-10 23:36:21'),
(0000000086, '会員086', '0000-00-00', NULL, NULL, '', '', NULL, NULL, NULL, '0000', '2020-10-10 09:50:24', '2020-10-10 23:36:21'),
(0000000087, '会員087', '0000-00-00', NULL, NULL, '', '', NULL, NULL, NULL, '0000', '2020-10-10 09:50:24', '2020-10-10 23:36:21'),
(0000000088, '会員088', '0000-00-00', NULL, NULL, '', '', NULL, NULL, NULL, '0000', '2020-10-10 09:50:24', '2020-10-10 23:36:21'),
(0000000089, '会員089', '0000-00-00', NULL, NULL, '', '', NULL, NULL, NULL, '0000', '2020-10-10 09:50:24', '2020-10-10 23:36:21'),
(0000000090, '会員090', '0000-00-00', NULL, NULL, '', '', NULL, NULL, NULL, '0000', '2020-10-10 09:50:24', '2020-10-10 23:36:21');

-- --------------------------------------------------------

--
-- テーブルの構造 `診療履歴`
--

CREATE TABLE `診療履歴` (
  `利用者ID` int(10) NOT NULL,
  `診療日時` datetime NOT NULL,
  `担当者名` varchar(30) COLLATE utf8mb4_bin NOT NULL,
  `診療内容` varchar(5000) COLLATE utf8mb4_bin NOT NULL,
  `登録日時` timestamp NOT NULL DEFAULT current_timestamp(),
  `更新日時` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_bin;

-- --------------------------------------------------------

--
-- テーブルの構造 `＿性別`
--

CREATE TABLE `＿性別` (
  `キー` tinyint(4) UNSIGNED NOT NULL,
  `名称` varchar(30) COLLATE utf8mb4_bin NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_bin;

--
-- テーブルのデータのダンプ `＿性別`
--

INSERT INTO `＿性別` (`キー`, `名称`) VALUES
(1, '男性'),
(2, '女性'),
(3, '未設定');

-- --------------------------------------------------------

--
-- テーブルの構造 `＿時間枠`
--

CREATE TABLE `＿時間枠` (
  `キー` smallint(3) UNSIGNED NOT NULL,
  `時間` varchar(6) COLLATE utf8mb4_bin NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_bin;

--
-- テーブルのデータのダンプ `＿時間枠`
--

INSERT INTO `＿時間枠` (`キー`, `時間`) VALUES
(1, '9:00'),
(2, '9:30'),
(3, '10:00'),
(4, '10:30'),
(5, '11:30');

-- --------------------------------------------------------

--
-- テーブルの構造 `＿診療種別`
--

CREATE TABLE `＿診療種別` (
  `キー` tinyint(3) UNSIGNED NOT NULL,
  `名称` varchar(30) COLLATE utf8mb4_bin NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_bin;

--
-- テーブルのデータのダンプ `＿診療種別`
--

INSERT INTO `＿診療種別` (`キー`, `名称`) VALUES
(1, '予防接種'),
(2, '一般診療');

--
-- ダンプしたテーブルのインデックス
--

--
-- テーブルのインデックス `スタッフ`
--
ALTER TABLE `スタッフ`
  ADD PRIMARY KEY (`スタッフＩＤ`);

--
-- テーブルのインデックス `予約情報`
--
ALTER TABLE `予約情報`
  ADD PRIMARY KEY (`予約番号`);

--
-- テーブルのインデックス `予防接種`
--
ALTER TABLE `予防接種`
  ADD PRIMARY KEY (`予防接種番号`);

--
-- テーブルのインデックス `利用者`
--
ALTER TABLE `利用者`
  ADD PRIMARY KEY (`利用者ID`);

--
-- テーブルのインデックス `＿性別`
--
ALTER TABLE `＿性別`
  ADD PRIMARY KEY (`キー`),
  ADD KEY `キー` (`キー`);

--
-- テーブルのインデックス `＿時間枠`
--
ALTER TABLE `＿時間枠`
  ADD PRIMARY KEY (`キー`);

--
-- テーブルのインデックス `＿診療種別`
--
ALTER TABLE `＿診療種別`
  ADD PRIMARY KEY (`キー`);

--
-- ダンプしたテーブルのAUTO_INCREMENT
--

--
-- テーブルのAUTO_INCREMENT `スタッフ`
--
ALTER TABLE `スタッフ`
  MODIFY `スタッフＩＤ` mediumint(5) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- テーブルのAUTO_INCREMENT `予約情報`
--
ALTER TABLE `予約情報`
  MODIFY `予約番号` int(10) UNSIGNED ZEROFILL NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=20;

--
-- テーブルのAUTO_INCREMENT `予防接種`
--
ALTER TABLE `予防接種`
  MODIFY `予防接種番号` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=13;

--
-- テーブルのAUTO_INCREMENT `利用者`
--
ALTER TABLE `利用者`
  MODIFY `利用者ID` int(10) UNSIGNED ZEROFILL NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=91;

--
-- テーブルのAUTO_INCREMENT `＿時間枠`
--
ALTER TABLE `＿時間枠`
  MODIFY `キー` smallint(3) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=12;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
